tutorials/Channel_U_Oscillatory/multi_phase/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default        cellLimited Gauss linear 1; 
}

divSchemes
{
    div(rhoPhiByEps,U)  Gauss vanLeer; // Gauss linearUpwind grad(U); //
    div(phi,alpha)  Gauss vanLeer01; //Gauss vanLeer;
    div(phirb,alpha)  Gauss vanLeer; //bounded Gauss upwind;
    div(((rho*nu)*dev2(T(grad(U))))) Gauss linear; //Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss vanLeer; //Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         orthogonal; 
}


// ************************************************************************* //
